int()# целое число
float()# дробное число
str()# текст
input("")#ввод чего-то с консоли
имя[0:1:2]# индексация[с:по:шаг]
       :-1]# обратный счёт
sum()# сумма
len()# количество элементов
type()# тип данных
(****** .upper/.lower)# заглавные / маленькие буквы
(***.replace(старое/новое))# замена Элементов
*=[ , , , , ]# список
***.append()# добавление в конец списка или иного
***.exten()#  добавление в конец списка или иного , с разбитем на единичные элементы
***.remove()# УДАЛЕНИЕ этого субъекта
("" in ***)#  проверка на наличие чегото в чёмто
("" not in ***)#  проверка на отсутствие чегото в чёмто


=  # приравнивание
:= # приравнивание с обновлением
!= # неравенство д/н
== # равенство
** # степень
%  # остаток от деления




f stroka